import React from "react";
import styles from "./AuthorPage.module.css"
import chingiz_a from "../../assests/images/Author/chingiz_a.jpg"
import first_book from "../../assests/images/Author/first_book.jpg"
import second_book from "../../assests/images/Author/second_book.jpg"
import star1 from "../../assests/images/Author/star1.svg"
import star2 from "../../assests/images/Author/star2.svg"

const AuthorPage = () => {
    return(
        <div className={styles.AuthorPage}>
            <div className={styles.about_author}>
                <div className={styles.main_text}><h1>Ч</h1><h4>ынгыз</h4>  <h1>А</h1><h4>йтматов</h4></div>
                <div className={styles.about_inner}>
                    <div className={styles.left}><img src={chingiz_a} alt=""/></div>
                    <div className={styles.right}>
                        <div className={styles.text}><p>Имя при рождении:</p><span>Чынгыз Торекулович Айтматов</span></div>
                        <div className={styles.text}><p>Дата рождения:</p><span>12 декабря 1928 года</span></div>
                        <div className={styles.text}><p>Место рождения:</p><span>Шекер, Таласский район Кыргызской ССР</span></div>
                        <div className={styles.text}><p>Гражданство:</p><span>Кыргызстан, СССР</span></div>
                        <div className={styles.text}><p>Жанр:</p><span>Повесть, Драма</span></div>
                        <div className={styles.text}><p>Язык:</p><span>Кыргызский, Русский</span></div>
                    </div>
                </div>
            </div>
            <div className={styles.books}>
                <div className={styles.main_text}><h1>П</h1><h4>роизведения</h4><h1>П</h1><h4>исателя</h4></div>
                <div className={styles.inner_books}>
                    <div className={styles.book}>
                        <div className={styles.left}><img src={first_book} alt=""/></div>
                        <div className={styles.right}>
                            <h2>Плаха</h2>
                            <p>Чынгыз Айтматов</p>
                            <div className={styles.stars}><img src={star1} alt=""/><img src={star1} alt=""/><img src={star1} alt=""/><img src={star1} alt=""/><img src={star2} alt=""/><p>4.8</p></div>
                            <button>Читать</button>
                        </div>
                    </div>
                    <div className={styles.book}>
                        <div className={styles.left}><img src={second_book} alt=""/></div>
                        <div className={styles.right}>
                            <h2>Плаха</h2>
                            <p>Чынгыз Айтматов</p>
                            <div className={styles.stars}><img src={star1} alt=""/><img src={star1} alt=""/><img src={star1} alt=""/><img src={star1} alt=""/><img src={star2} alt=""/><p>4.8</p></div>
                            <button>Читать</button>
                        </div>
                    </div>
                </div>
            </div>
            <div className={styles.biography}>
                <h3>Биография</h3>
                <p className={styles.bio_text}>Происхождение Родился 12 декабря 1928 года в селе Шекер Таласского кантона Киргизской АССР (ныне Таласской области Киргизии). Его отец, Торекул Айтматов (1903—1938), был вначале крестьянским активистом, затем советским и партийным работником, видным государственным деятелем Киргизской ССР; в 1937 году был арестован, в 1938 году — расстрелян. Мать, Нагима Абдувалиева (1904—1971), татарка по национальности, была армейским политработником, впоследствии общественным деятелем. Чингиз, его братья и сёстры выросли в Шекере, куда прибыли незадолго до ареста отца по его настоянию. В годы Великой Отечественной войны четырнадцатилетний подросток стал секретарём совета в ауле; работал учителем, финагентом, помощником комбайнера и тракториста.
                Окончив восемь классов, поступил в Джамбульский зоотехникум (сейчас Куланский агротехнический колледж), который окончил с отличием. В 1948 году поступил в Киргизский сельскохозяйственный институт во Фрунзе, который окончил в 1953 году.
                Литературная деятельность Дебютировал в печати в 1952 году написанным на русском языке рассказом «Газетчик Дзюйо», после чего публиковал рассказы на киргизском и русском языках. По окончании института в течение трёх лет работал ветеринаром, одновременно продолжая писать и печатать рассказы.</p>
                <h3>Литературная деятельность</h3>
                <p>Дебютировал в печати в 1952 году написанным на русском языке рассказом «Газетчик Дзюйо», после чего публиковал рассказы на киргизском и русском языках. По окончании института в течение трёх лет работал ветеринаром, одновременно продолжая писать и печатать рассказы.
                В 1956 году поступил на Высшие литературные курсы в Москве, которые окончил в 1958 году. Повесть «Лицом к лицу» на киргизском языке была опубликована в июне 1957 года в журнале «Ала-Тоо» и в следующем году в журнале «Октябрь» в авторском переводе на русский язык. В 1958 году увидела свет повесть «Джамиля», принёсшая Айтматову мировую известность (и тогда же переведённая на французский Луи Арагоном) и был главным редактором журнала «Литературный Киргизстан», одновременно работал собственным корреспондентом газеты «Правда» по Киргизской ССР. Член КПСС с 1959 года.
                После «Джамили» были также опубликованы повести «Верблюжий глаз» (1960), «Первый учитель» (1961), «Материнское поле» (1963) и сборник «Повести гор и степей» (1963), за который писатель получил Ленинскую премию. Все эти произведения выходили одновременно на киргизском и в русском переводе. В 1965 году повесть «Первый учитель» была экранизирована Андреем Кончаловским на «Мосфильме», также «Верблюжий глаз» был экранизирован Ларисой Шепитько с Болотом Шамшиевым в роли Кемела.
                Повесть «Прощай, Гульсары!» (1966) принесла Айтматову Государственную премию. До неё он писал на двух языках (главным образом на киргизском), а после перешёл в основном на русский. Повесть «Белый пароход» (1970) была опубликована на русском языке; её экранизация была показана на международных кинофестивалях в Берлине и Венеции. Совместная работа Айтматова с казахским драматургом Калтаем Мухамеджановым — пьеса «Восхождение на Фудзияму» (1973) — до сих пор не сходит с театральных сцен Казахстана. За повесть «Ранние журавли» (1975) Айтматов получил киргизскую премию имени Токтогула. 31 августа 1973 года подписал письмо группы советских писателей о Солженицыне и Сахарове. В 1977 году опубликована повесть «Пегий пёс, бегущий краем моря», позднее также экранизированная немецкими и русскими кинематографистами. В 1978 году удостоен звания Героя Социалистического Труда. В 1980 году вышел роман «И дольше века длится день», за который Айтматов получил вторую Государственную премию. Последним произведением, опубликованным в СССР, является роман «Плаха» (1986). Во время визита в ФРГ познакомился с Фридрихом Хитцером, впоследствии немецким переводчиком и менеджером, с которым проработал до января 2007 года, когда переводчик внезапно скончался от инфаркта.</p>
            </div>
        </div>
    )
}

export default AuthorPage